Tekla.Structures.ModelInternal.Operation.ImportBuildingHierarchyDataFromReferenceModel(System.String,System.Int32)
Imports the given reference models building hierarchy data. If reference model file is provided, gets
data from the file. If reference model id is given, the data is retrieved from that, and file is then ignored.
referenceModelFile: The reference model (TrimBIM) file name and path.
referenceModelId: The reference model id.
Returns: True if anything imported from reference model, otherwise false.